OpenFOAM-3.0.0/run/motorBike/motorBikeLES/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          swGAMG;
        tolerance       1e-6;
        relTol          0.05;

        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    };

    pFinal
    {
        $p;
        relTol          0;
    };

    "(U|k|B|nuTilda)"
    {
		solver          swPBiCGStab;
		preconditioner  swDiagonal;
//        solver          smoothSolver;
//        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
    };
}

PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    "U.*"               1;
    "nuTilda.*"         1;
}


// ************************************************************************* //
