OpenFOAM-3.0.0/run/motorBike/motorBikeLES/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set-up the LES case
cp ../lesFiles/fvS* ../lesFiles/controlDict system/
cp ../lesFiles/turbulenceProperties constant/

ls -d processor* | xargs -I {} rm -rf ./{}/0 $1
ls -d processor* | xargs -I {} mv ./{}/500 ./{}/0 $1
ls -d processor* | xargs -I {} rm -rf ./{}/0/uniform $1

runParallel pisoFoam 8

runApplication reconstructParMesh -constant -mergeTol 1e-6

runApplication reconstructPar
